#Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции
chislo=int(input("Vvedite chislo"))
a=chislo%10
b=a//10
while b>0:
    if b%10 > a:
        a=b%10
    b=b//10
print(a)